benchmarks/results/2026-07-14_portfolio/raw/laravel_getip_1.txt
This is ApacheBench, Version 2.3 <$Revision: 1934973 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:
Server Hostname:        127.0.0.1
Server Port:            18080

Document Path:          /getip?format=json
Document Length:        279 bytes

Concurrency Level:      50
Time taken for tests:   6.690 seconds
Complete requests:      5000
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      3710000 bytes
HTML transferred:       1395000 bytes
Requests per second:    747.38 [#/sec] (mean)
Time per request:       66.901 [ms] (mean)
Time per request:       1.338 [ms] (mean, across all concurrent requests)
Transfer rate:          541.56 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     3   67  29.0     85      98
Waiting:        2   66  29.1     84      98
Total:          4   67  29.0     85      98

Percentage of the requests served within a certain time (ms)
  50%     85
  66%     86
  75%     88
  80%     89
  90%     92
  95%     93
  98%     94
  99%     94
 100%     98 (longest request)