benchmarks/results/2026-07-14_portfolio/raw/laravel_getip_2.txt
This is ApacheBench, Version 2.3 <$Revision: 1934973 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:
Server Hostname:        127.0.0.1
Server Port:            18080

Document Path:          /getip?format=json
Document Length:        279 bytes

Concurrency Level:      50
Time taken for tests:   6.621 seconds
Complete requests:      5000
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      3710000 bytes
HTML transferred:       1395000 bytes
Requests per second:    755.16 [#/sec] (mean)
Time per request:       66.211 [ms] (mean)
Time per request:       1.324 [ms] (mean, across all concurrent requests)
Transfer rate:          547.20 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     3   66  29.0     84      97
Waiting:        3   66  29.0     84      97
Total:          4   66  29.0     85      97

Percentage of the requests served within a certain time (ms)
  50%     85
  66%     86
  75%     87
  80%     88
  90%     92
  95%     92
  98%     93
  99%     94
 100%     97 (longest request)