benchmarks/results/2026-07-14_portfolio/raw/laravel_getip_5.txt
This is ApacheBench, Version 2.3 <$Revision: 1934973 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:
Server Hostname:        127.0.0.1
Server Port:            18080

Document Path:          /getip?format=json
Document Length:        279 bytes

Concurrency Level:      50
Time taken for tests:   6.677 seconds
Complete requests:      5000
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      3710001 bytes
HTML transferred:       1395000 bytes
Requests per second:    748.88 [#/sec] (mean)
Time per request:       66.766 [ms] (mean)
Time per request:       1.335 [ms] (mean, across all concurrent requests)
Transfer rate:          542.65 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     3   66  28.9     85      98
Waiting:        3   66  29.0     84      98
Total:          3   66  28.9     85      98

Percentage of the requests served within a certain time (ms)
  50%     85
  66%     86
  75%     87
  80%     88
  90%     92
  95%     93
  98%     94
  99%     95
 100%     98 (longest request)