benchmarks/results/2026-07-14_portfolio/raw/laravel_getuuid_1.txt
This is ApacheBench, Version 2.3 <$Revision: 1934973 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:
Server Hostname:        127.0.0.1
Server Port:            18080

Document Path:          /getuuid?version=7
Document Length:        72 bytes

Concurrency Level:      50
Time taken for tests:   6.808 seconds
Complete requests:      5000
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      3655000 bytes
HTML transferred:       360000 bytes
Requests per second:    734.41 [#/sec] (mean)
Time per request:       68.082 [ms] (mean)
Time per request:       1.362 [ms] (mean, across all concurrent requests)
Transfer rate:          524.27 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     3   68  28.7     85      99
Waiting:        2   68  28.7     85      99
Total:          4   68  28.7     85      99

Percentage of the requests served within a certain time (ms)
  50%     85
  66%     86
  75%     88
  80%     90
  90%     92
  95%     94
  98%     95
  99%     96
 100%     99 (longest request)